{"convertedBy": "TensorFlow.js Converter v1.1.2", "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"shape": [16, 35], "name": "dense/kernel", "dtype": "float32"}, {"shape": [35], "name": "dense/bias", "dtype": "float32"}, {"shape": [35, 10], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [10], "name": "dense_1/bias", "dtype": "float32"}, {"shape": [10, 2], "name": "dense_2/kernel", "dtype": "float32"}, {"shape": [2], "name": "dense_2/bias", "dtype": "float32"}]}], "generatedBy": "keras v2.2.4-tf", "format": "layers-model", "modelTopology": {"keras_version": "2.2.4-tf", "model_config": {"config": {"name": "sequential", "layers": [{"config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "batch_input_shape": [null, 16], "name": "dense", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 35}, "class_name": "Dense"}, {"config": {"rate": 0.3, "dtype": "float32", "name": "dropout", "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "use_bias": true, "name": "dense_1", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 10}, "class_name": "Dense"}, {"config": {"rate": 0.2, "dtype": "float32", "name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "kernel_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "use_bias": true, "name": "dense_2", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "units": 2}, "class_name": "Dense"}]}, "class_name": "Sequential"}, "training_config": {"optimizer_config": {"config": {"name": "SGD", "momentum": 0.8999999761581421, "decay": 0.0003800000122282654, "learning_rate": 0.0949999988079071, "nesterov": true}, "class_name": "SGD"}, "weighted_metrics": null, "loss_weights": null, "metrics": ["accuracy"], "sample_weight_mode": null, "loss": "binary_crossentropy"}, "backend": "tensorflow"}}